IDENTIFICATION DIVISION.
PROGRAM-ID.   HELLO-WORLD.
AUTHOR.       MANTAS TUMENAS.
DATE-WRITTEN. 2017-03-31.
PROCEDURE DIVISION.
DISPLAY 'Hello, world'.
STOP RUN.
